//BANKJOB JOB (123),'BANK PROJECT',CLASS=A,MSGCLASS=A
//STEP1 EXEC PGM=IGYCRCTL
//SYSIN DD *
  (COBOL SOURCE PROGRAM)
/*
//STEP2 EXEC PGM=BANKACCT
//SYSOUT DD SYSOUT=*