      IDENTIFICATION DIVISION.
       PROGRAM-ID. BANKACCT.

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       WORKING-STORAGE SECTION.
       01 WS-NAME         PIC X(20).
       01 WS-ACCNO        PIC 9(6).
       01 WS-BALANCE      PIC 9(7)V99.
       01 WS-DEPOSIT      PIC 9(5)V99.
       01 WS-WITHDRAW     PIC 9(5)V99.

       PROCEDURE DIVISION.
       DISPLAY "ENTER ACCOUNT NUMBER : ".
       ACCEPT WS-ACCNO.

       DISPLAY "ENTER CUSTOMER NAME : ".
       ACCEPT WS-NAME.

       DISPLAY "ENTER CURRENT BALANCE : ".
       ACCEPT WS-BALANCE.

       DISPLAY "ENTER DEPOSIT AMOUNT : ".
       ACCEPT WS-DEPOSIT.

       ADD WS-DEPOSIT TO WS-BALANCE.

       DISPLAY "ENTER WITHDRAW AMOUNT : ".
       ACCEPT WS-WITHDRAW.
       IF WS-WITHDRAW <= WS-BALANCE
           SUBTRACT WS-WITHDRAW FROM WS-BALANCE
           DISPLAY "WITHDRAW SUCCESSFUL"
       ELSE
           DISPLAY "INSUFFICIENT BALANCE"
       END-IF.

       DISPLAY "-----------------------------".
       DISPLAY "ACCOUNT NUMBER : " WS-ACCNO.
       DISPLAY "CUSTOMER NAME  : " WS-NAME.
       DISPLAY "FINAL BALANCE  : " WS-BALANCE.
       DISPLAY "-----------------------------".

       STOP RUN.



output : ENTER ACCOUNT NUMBER : 
ENTER CUSTOMER NAME : 
ENTER CURRENT BALANCE : 
ENTER DEPOSIT AMOUNT : 
ENTER WITHDRAW AMOUNT : 
WITHDRAW SUCCESSFUL
-----------------------------
ACCOUNT NUMBER : 000000
CUSTOMER NAME  :                     
FINAL BALANCE  : 0000000.00
-----------------------------
