### REVERSE ORDER
IDENTIFICATION DIVISION
PROGRAM-ID. PGM01.
ENVIRONMENT DIVISION.
DATA DIVISION.
01 A PIC A(05) VALUE 12345.
01 B PIC A(05) VALUE 'ZERO'.
PROCEDURE DIVISION.
MOVE A(5:1) TO B(1:1)
MOVE A(4:1) TO B(2:1)
MOVE A(3:1) TO B(3:1)
MOVE A(2:1) TO B(4:1)
MOVE A(1:1) TO B(5:1)
DISPLAY B
STOP RUN.
O/P: 54321
### THE RIGHT ANGLE TRIANGLE
IDENTIFICATION DIVISION.
PROGRAM-ID. PGM02.
ENVIRONMENT DIVISION.
DATA DIVISION.
01 A  PIC X(05) VALUE '*****'.
PROCEDURE DIVISION.
DISPLAY A        | MOVE A(1:5) TO B(1:5)
DISPLAY A(1:4).  | MOVE A(1:4) TO B(1:4)
DISPLAY A(1:3).  | MOVE A(1:3) TO B(1:3) 
DISPLAY A(1:2).  | MOVE A(1:2) TO B(1:2)
DISPLAY A(1:1).  | MOVE A(1:1) TO B(1:1)
STOP RUN.        | STOP RUN.
O/P: *****
     ****
     ***
     **
     *
### LEFT ANGLE TRIANGLE
IDENTIFICATION DIVISION.
PROGRAM-ID. PGM04
ENVIRONMENT DIVISION.
DATA DIVISION.
01 A PIC 9(05) VALUE 12345.
01 B PIC 9(05).
PROCEDURE DIVISION.      O/P: 
MOVE A(1:1) TO B(5:1).               1
MOVE A(1:2) TO B(4:2).             1 2 
MOVE A(1:3) TO B(3:3).           1 2 3
MOVE A(1:4) TO B(2:4).         1 2 3 4
MOVE A(1:5) TO B(1:5).       1 2 3 4 5  
DISPLAY B
STOP RUN.
### RIGHT ANGLE TRIANGLE
IDENTIFICATION DIVISION.
PROGRAM-ID. PGM05.
ENVIRONMENT DIVISION.
DATA DIVISION.
01  A PIC 9(05) VALUE 12345.
01  B PIC 9(05).
PROCEDURE DIVISION.
MOVE A(1:1) TO B(5:1) 
MOVE A(2:1) TO B(4:1)
MOVE A(3:1) TO B(3:1)
MOVE A(4:1) TO B(2:1)
MOVE A(5:1) TO B(1:1)   O/P: 
DISPLAY B.               5 4 3 2 1
DISPLAY B(1:4).          5 4 3 2
DISPLAY B(1:3).          5 4 3
DISPLAY B(1:2).          5 4
DISPLAY B(1:1).          5
STOP RUN.




